gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
#include "nrf_drv_spi.h"
#include "nrf_spi_mngr.h"
#include "nrf_drv_timer.h"
// #include "nrf_gpio.h"
#include "nrfx_gpiote.h"
#include "nrfx_ppi.h"
// #include "nrfx_spim.h"

#include "nrf_log.h"
#include "nrf_twi_mngr.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "howland.h"
#include "test\test.h"

NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, IDT_TWI_MAX_PENDING_TRANSACTIONS, IDT_TWI_INSTANCE);

static uint8_t idt_txbuf[16] = { 0 };
static uint8_t idt_rxbuf[16] = { 0 };

// TWI (with transaction manager) initialization.
static void twi_config(void) {
  uint32_t err_code;

  nrf_drv_twi_config_t const config = {
      .scl = IDT_SCL_PIN,
      .sda = IDT_SDA_PIN,
      .frequency = NRF_DRV_TWI_FREQ_400K,
      .interrupt_priority = APP_IRQ_PRIORITY_LOWEST,
      .clear_bus_init = false
  };

  err_code = nrf_twi_mngr_init(&m_nrf_twi_mngr, &config);
  APP_ERROR_CHECK(err_code);
}

static void read_reg(uint8_t addr, uint8_t numOfRegs) 
{
    uint32_t err;
    static nrf_twi_mngr_transfer_t rxfers[] = {
        NRF_TWI_MNGR_WRITE(IDT_I2C_ADDR, idt_txbuf, 2, NRF_TWI_MNGR_NO_STOP),
        NRF_TWI_MNGR_READ (IDT_I2C_ADDR, idt_rxbuf, 1, 0)
    };    
    
    idt_txbuf[0] = 0x00;
    idt_txbuf[1] = 0x3C;
    idt_txbuf[2] = 0x78;
    
    err = nrf_twi_mngr_perform(&m_nrf_twi_mngr, NULL, rxfers, 2, NULL);
    APP_ERROR_CHECK(err);
    
    NRF_LOG_INFO("read 0x3c reg %x", idt_rxbuf[0]);
    
    static nrf_twi_mngr_transfer_t txfers[] = {
        NRF_TWI_MNGR_WRITE(IDT_I2C_ADDR, idt_txbuf, 3, NULL),
    };  

    err = nrf_twi_mngr_perform(&m_nrf_twi_mngr, NULL, txfers, 3, 0);
    APP_ERROR_CHECK(err);    
    
    err = nrf_twi_mngr_perform(&m_nrf_twi_mngr, NULL, rxfers, 2, NULL);
    APP_ERROR_CHECK(err);
    
    NRF_LOG_INFO("read 0x3c reg %x", idt_rxbuf[0]);    
}

/**
 * DAC088S085 Commands
 *
 * 0xF x 8b     Power Down 2.5kOhm output
 * 0xE x 8b     Power Down 100kOhm output
 * 0xD x 8b     Power Down HighZ
 * 0xC 8d x     broadcast
 * 0xB 8d x     Channel A Write
 * 0xA x 8b     Update select
 * 0x9 x  x     set wtm mode
 * 0x8 x  x     set wrm mode (default)
 * 0x7 8d x     set channel H
 * 0x6 8d x
 *  .
 *  .
 * 0x0 8d x     set channel A
 */

/* This has been fixed in v2 board. 
 *
 * also, due to layout, pin name and netname inconsistent
 *
 * PIN NAME     NET NAME        PORT NAME
 * A            VOUTE           PORT_F
 * B            VOUTF           PORT_E
 * C            VOUTG (TP1)     PORT_B (TP2)
 * D            VOUTH (TP3)     PORT_A (TP4)
 * E            VOUTA           PORT_G
 * F            VOUTB           PORT_H
 * G            VOUTC (TP9)     PORT_C (TP8)
 * H            VOUTD (TP7)     PORT_D (TP6)
 *
 * TPs (at top edge/side) are numbered 1234 5 6789 from left to right, 5 is VMID (2.5V)
 */

/**
 * freertos task
 */
static TaskHandle_t m_thread = NULL;

/**
 * freertos queue
 */
#define INCOMMING_QUEUE_DEPTH               8

static QueueHandle_t m_incomming_idle       = NULL;
static QueueHandle_t m_incomming_pending    = NULL;
static ble_incomming_message_t m_message_pool[INCOMMING_QUEUE_DEPTH] = { 0 };

static void incomming_queue_init(void)
{
    ble_incomming_message_t * p_msg;

    m_incomming_idle = xQueueCreate(INCOMMING_QUEUE_DEPTH, sizeof(ble_incomming_message_t *));
    APP_ERROR_CHECK_BOOL(m_incomming_idle != NULL);
    m_incomming_pending = xQueueCreate(INCOMMING_QUEUE_DEPTH, sizeof(ble_incomming_message_t *));
    APP_ERROR_CHECK_BOOL(m_incomming_idle != NULL);

    for (int i = 0; i < INCOMMING_QUEUE_DEPTH; i++)
    {
        p_msg = &m_message_pool[i];
        BaseType_t result = xQueueSend(m_incomming_idle, &p_msg, 0);
        APP_ERROR_CHECK_BOOL(result == pdTRUE);
    }
}

/**
 * module wide statics
 */
// m_msg is both state and message
static ble_incomming_message_t m_msg = {
    .c              = 0,
    .timeout        = 0,
    .freq           = 100,
    .num_of_pulses  = 1,
    .pulse_width    = 50,
    .pulse_interval = 0,
    .hold           = 0,
    .recycle_ratio  = 4,
};

/**
 * SPI and DAC088S085CIMT
 */
nrf_drv_spi_t const m_dac_spi = NRF_DRV_SPI_INSTANCE(DAC_SPI_INSTANCE);  /**< SPI instance. */

nrf_drv_spi_config_t const m_dac_spi_config =
{
    .sck_pin        = DAC_SPI_CK_PIN,
    .mosi_pin       = DAC_SPI_SI_PIN,
    .miso_pin       = NRF_DRV_SPI_PIN_NOT_USED,
    .ss_pin         = DAC_SPI_SS_PIN,
    .irq_priority   = APP_IRQ_PRIORITY_LOWEST,
    .orc            = 0xFF,
    .frequency      = NRF_DRV_SPI_FREQ_8M,
    .mode           = NRF_DRV_SPI_MODE_1,
    .bit_order      = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

/*
 * noss (3-wire) version is used. ss pin is controlled by timer/ppi
 */
nrf_drv_spi_config_t const m_dac_spi_config_noss =
{
    .sck_pin        = DAC_SPI_CK_PIN,
    .mosi_pin       = DAC_SPI_SI_PIN,
    .miso_pin       = NRF_DRV_SPI_PIN_NOT_USED,
    .ss_pin         = NRF_DRV_SPI_PIN_NOT_USED,
    .irq_priority   = APP_IRQ_PRIORITY_LOWEST,
    .orc            = 0xFF,
    .frequency      = NRF_DRV_SPI_FREQ_8M,
    .mode           = NRF_DRV_SPI_MODE_1,
    .bit_order      = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST
};

/**
 * WRM Write Register Mode, registered are written without updating output
 * WTM Write Through Mode, output is updated immediately after the register is written
 * defaults to WRM mode after power up
 */
typedef enum {
    DAC_WRM_MODE = 0,
    DAC_WTM_MODE
} dac_update_mode_t;

// see
static uint16_t dac_wrm_mode = 0x8000;
static uint16_t dac_wtm_mode = 0x9000;
static uint16_t dac_cmd_update_select = 0xA000;
static uint16_t dac_cmd_update_all = 0xA0FF;
static uint16_t dac_cmd_chan_a_write = 0xB000;
static uint16_t dac_cmd_broadcast = 0xC000;

static nrf_spi_mngr_transfer_t dac_wrm_mode_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_wrm_mode, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_wtm_mode_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_wtm_mode, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_update_select_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_update_select, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_chan_a_write_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_chan_a_write, 2, NULL, 0) };
static nrf_spi_mngr_transfer_t dac_cmd_broadcast_xfer[] = { NRF_SPI_MNGR_TRANSFER(&dac_cmd_broadcast, 2, NULL, 0) };

static uint16_t dac_reg_init[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };
static uint16_t dac_reg_pulse[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };
static uint16_t dac_reg_recycle[8] = { 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800, 0x0800 };

