gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
/***
 * SPI and Analog Switch
 *
 * hardware signal mapping
 * A -> S6 (1 << 5) 0x20
 * B -> S5 (1 << 4) 0x10
 * C -> S4 (1 << 3) 0x08
 * D -> S3 (1 << 2) 0x04
 * E -> S8 (1 << 7) 0x80
 * F -> S7 (1 << 6) 0x40
 * G -> S2 (1 << 1) 0x02
 * H -> S1 (1 << 0) 0x01
 */

// in v2 board, analog switch removed.

/**
 * Timer
 */
const nrf_drv_timer_t m_count_timer = NRF_DRV_TIMER_INSTANCE(COUNT_TIMER_ID);
const nrf_drv_timer_t m_cycle_timer = NRF_DRV_TIMER_INSTANCE(CYCLE_TIMER_ID);
const nrf_drv_timer_t m_spi_timer = NRF_DRV_TIMER_INSTANCE(BURST_TIMER_ID);

static void test2_count_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("count 0");
            break;
        default:
            break;
    }
}

static void test2_burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("burst 0 -");
            break;
        default:
            NRF_LOG_INFO("burst fired");
            break;
    }
}

static void test2_cycle_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            NRF_LOG_INFO("cycle 0 +");
            nrf_drv_timer_clear(&m_spi_timer);
            break;
        case NRF_TIMER_EVENT_COMPARE1:
            NRF_LOG_INFO("cycle channel 1 fired");
            break;
        default:
            break;
    }
}

static void test2_timer_init(void)
{
    uint32_t err_code;

    nrf_drv_timer_config_t count_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    count_cfg.mode = (nrf_timer_mode_t)1;   // 1 for counter mode,
    err_code = nrf_drv_timer_init(&m_count_timer, &count_cfg, test2_count_timer_callback);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_cycle_timer, &timer_cfg, test2_cycle_timer_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_timer_init(&m_spi_timer, &timer_cfg, test2_burst_timer_callback);
    APP_ERROR_CHECK(err_code);
}

/**
 * In test2, the lifespan of cycle timer contains five cycle or burst timer.
 *
 * burst timer is one-shot, log a number in interrupt.
 * cycle timer compares to 1s, ppi to increment counter and to start burst timer as well.
 * counter set to compare 5.
 *
 */
static void test2_run(void)
{
    (void)test2_run;
    nrfx_err_t err;

    test2_timer_init();

    // count timer channel 0 count to 5
    nrf_drv_timer_extended_compare(&m_count_timer, NRF_TIMER_CC_CHANNEL0, 5, NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);

    // short-lived one-shot, print in isr, triggered by cycle timer
    nrf_drv_timer_extended_compare(&m_spi_timer, NRF_TIMER_CC_CHANNEL0, 50, NRF_TIMER_SHORT_COMPARE0_STOP_MASK, true);
    // nrf_drv_timer_compare(&m_spi_timer, NRF_TIMER_CC_CHANNEL0, 1000, true);
    // nrf_drv_timer_enable(&m_spi_timer);

    // cycle timer repeats in seconds.
    nrf_drv_timer_extended_compare(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0, 2 * 1000 * 1000, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    // cycle start burst
    nrf_ppi_channel_t cycle_start_burst;
    err = nrfx_ppi_channel_alloc(&cycle_start_burst);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(cycle_start_burst,
                                  nrfx_timer_compare_event_address_get(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_spi_timer, NRF_TIMER_TASK_START));
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(cycle_start_burst);
    APP_ERROR_CHECK(err);

    // cycle increment count
    nrf_ppi_channel_t cycle_increment_count;
    err = nrfx_ppi_channel_alloc(&cycle_increment_count);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(cycle_increment_count,
                                  nrfx_timer_compare_event_address_get(&m_cycle_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_count_timer, NRF_TIMER_TASK_COUNT));
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(cycle_increment_count);
    APP_ERROR_CHECK(err);

    // count stop cycle
    nrf_ppi_channel_t count_stop_cycle;
    err = nrfx_ppi_channel_alloc(&count_stop_cycle);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_assign(count_stop_cycle,
                                  nrfx_timer_compare_event_address_get(&m_count_timer, NRF_TIMER_CC_CHANNEL0),
                                  nrfx_timer_task_address_get(&m_cycle_timer, NRF_TIMER_TASK_STOP));
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(count_stop_cycle);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_count_timer);
    nrf_drv_timer_enable(&m_cycle_timer);

    NRF_LOG_INFO("test2 started 2");
}

static void burst_timer_callback(nrf_timer_event_t event_type, void * p_context)
{
}


#ifndef DAC_USE_SPI_MNGR

static void test4_run(void)
{
    (void)test4_run;

    NRF_LOG_INFO("test04, power down all but H (VOUTD,PORTD), toggle VOUTD (TP7)");

    static uint8_t pd[2] = { 0xD0, 0x3F };  // power down all but h
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t hh[2] = { 0x78, 0x00 };  // set channel h high
    static uint8_t hl[2] = { 0x70, 0x00 };  // set channel h low

    nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, NULL, NULL);
    nrf_drv_spi_transfer(&m_dac_spi, pd, 2, NULL, 0);
    nrf_drv_spi_transfer(&m_dac_spi, wt, 2, NULL, 0);

    for (;;)
    {
        nrf_drv_spi_transfer(&m_dac_spi, hh, 2, NULL, 0);
        vTaskDelay(512);
        nrf_drv_spi_transfer(&m_dac_spi, hl, 2, NULL, 0);
        vTaskDelay(512);
    }
}

static void test5_run(void)
{
    (void)test5_run;

    NRF_LOG_INFO("test 5, power down all but G (VOUTC,PORTC) and toggle");
    NRF_LOG_INFO("  VOUTC (TP9) should toggle");

    static uint8_t pd[2] = { 0xD0, 0xBF };  // power down all but g
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t gh[2] = { 0x68, 0x00 };  // set channel g high
    static uint8_t gl[2] = { 0x60, 0x00 };  // set channel g low

