gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
static void test20_timer_init(void)
{
    uint32_t err_code;
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_spi_timer, &timer_cfg, test20_cycle_timer_callback);  // TODO
    APP_ERROR_CHECK(err_code);
}

#ifndef DAC_USE_SPI_MNGR
static void dummy_spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context)
{
    ret_code_t err;
    static uint8_t gh[2] = { 0x6F, 0xF0 };  // set channel g high
    static uint8_t gl[2] = { 0x60, 0x00 };  // set channel g low
    static nrf_drv_spi_xfer_desc_t xfer_gh = { .p_tx_buffer = gh, .tx_length = 2, };
    static nrf_drv_spi_xfer_desc_t xfer_gl = { .p_tx_buffer = gl, .tx_length = 2, };

    dac_spi_ctx_t *p_ctx = (dac_spi_ctx_t *)p_context;

    if (p_ctx->bypass) {
        NRF_LOG_INFO("spi event bypass");
        return;
    }

    if (p_ctx->value == 0)
    {
        err = nrf_drv_spi_xfer(&m_dac_spi, &xfer_gl, NRF_DRV_SPI_FLAG_HOLD_XFER);
        APP_ERROR_CHECK(err);
    }
    else
    {
        err = nrf_drv_spi_xfer(&m_dac_spi, &xfer_gh, NRF_DRV_SPI_FLAG_HOLD_XFER);
        APP_ERROR_CHECK(err);
    }
    p_ctx->value = !p_ctx->value;
}

/**
 * burst timer used in this test, with rise, fall, and rewind compares. Rewind is set to 100Hz.
 * rise triggers spi task to rise g
 * fall triggers spi task to fall g
 * for example:
 * 1 init
 * 2 xfer (hold) high
 * 3 loop timer
 *   rise ppi> spi task -> done interrupt -> code toggle xfer (hold)
 *   fall ppi> spi task -> done interrupt -> code toggle xfer (hold)
 *
 * !!! PROBLEM !!!
 * it is seen that the pulse may be inverted due interrupt overlap or missing.
 * on oscilloscope we can see the spi interface signal, cs and clock (or data), the cs pull down
 * persists almost 60us, which is too high. we try to solve this problem in next test, using PPI to control
 * cs pin, rather than spi driver.
 */
static void test20_run(void)
{
    (void)test20_run;

    nrfx_err_t err;
    nrf_ppi_channel_t ppi_channel_rise;
    nrf_ppi_channel_t ppi_channel_fall;

    static dac_spi_ctx_t ctx = { 0 };

    err = nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config, dummy_spi_event_handler, &ctx);
    APP_ERROR_CHECK(err);

    test20_timer_init();

    // rise
    nrf_drv_timer_compare(&m_spi_timer,
                          NRF_TIMER_CC_CHANNEL0,
                          100,
                          false);
    // fall
    nrf_drv_timer_compare(&m_spi_timer,
                          NRF_TIMER_CC_CHANNEL1,
                          160,
                          false);

    // rewind
    nrf_drv_timer_extended_compare(&m_spi_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   10 * 1000,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);
    // rise ppi
    err = nrfx_ppi_channel_alloc(&ppi_channel_rise);
    APP_ERROR_CHECK(err);

    uint32_t rise_event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL0);
    uint32_t rise_task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);

    err = nrfx_ppi_channel_assign(ppi_channel_rise, rise_event_addr, rise_task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_rise);
    APP_ERROR_CHECK(err);

    // fall ppi
    err = nrfx_ppi_channel_alloc(&ppi_channel_fall);
    APP_ERROR_CHECK(err);

    uint32_t fall_event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL1);
    uint32_t fall_task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);

    err = nrfx_ppi_channel_assign(ppi_channel_fall, fall_event_addr, fall_task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_fall);
    APP_ERROR_CHECK(err);

    /* init dac */
    static uint8_t pd[2] = { 0xD0, 0x3F };  // power down all but g and h
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t hm[2] = { 0x78, 0x00 };  // set channel h to half
    static uint8_t gh[2] = { 0x6E, 0xB0 };  // set channel g high
    static uint8_t gl[2] = { 0x61, 0x00 };  // set channel g low

    static nrf_drv_spi_xfer_desc_t xfer = { .tx_length = 2, };
    xfer.p_tx_buffer = pd;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(10);

    xfer.p_tx_buffer = wt;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(10);

    xfer.p_tx_buffer = hm;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(10);

    // assure low is seen on oscilloscope for 3 seconds
    xfer.p_tx_buffer = gl;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(3000);


    xfer.p_tx_buffer = gh;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_HOLD_XFER);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_spi_timer);
    NRF_LOG_INFO("test20: burst timer started");
}

static void test21_run(void)
{
    (void)test21_run;

    uint32_t err, event_addr, task_addr;

    err = nrfx_gpiote_init();
    APP_ERROR_CHECK(err);

    // nrfx_gpiote_out_config_t ss_pin_config = NRFX_GPIOTE_CONFIG_OUT_SIMPLE(true);
    nrfx_gpiote_out_config_t ss_pin_config = NRFX_GPIOTE_CONFIG_OUT_TASK_TOGGLE(true); // task pin, initial high
    err = nrfx_gpiote_out_init(DAC_SPI_SS_PIN, &ss_pin_config);
    APP_ERROR_CHECK(err);

    nrfx_gpiote_out_task_enable(DAC_SPI_SS_PIN);

    nrf_ppi_channel_t ppi_channel_rise;
    nrf_ppi_channel_t ppi_channel_rise_ss;

    nrf_ppi_channel_t ppi_channel_fall;
    nrf_ppi_channel_t ppi_channel_fall_ss;

    nrf_ppi_channel_t ppi_channel_spi_end;

    static dac_spi_ctx_t ctx = {
        .bypass = true,
    };

    err = nrf_drv_spi_init(&m_dac_spi, &m_dac_spi_config_noss, dummy_spi_event_handler, &ctx);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err = nrf_drv_timer_init(&m_spi_timer, &timer_cfg, test20_cycle_timer_callback);  // TODO
    APP_ERROR_CHECK(err);

    // rise
    nrf_drv_timer_compare(&m_spi_timer,
                          NRF_TIMER_CC_CHANNEL0,
                          100,
                          false);
    // fall
    nrf_drv_timer_compare(&m_spi_timer,
                          NRF_TIMER_CC_CHANNEL1,
                          160,
                          false);

    // rewind
    nrf_drv_timer_extended_compare(&m_spi_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   10 * 1000,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);
    // rise ppi ss
    err = nrfx_ppi_channel_alloc(&ppi_channel_rise_ss);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL0);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

