gingerologist/nRF5_SDK_17.1.0_ddde560_stim/examples/ble_peripheral/ble_app_uart/howland.c
    err = nrfx_ppi_channel_assign(ppi_channel_rise_ss, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_rise_ss);
    APP_ERROR_CHECK(err);

    // rise ppi
    err = nrfx_ppi_channel_alloc(&ppi_channel_rise);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL0);
    task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);

    err = nrfx_ppi_channel_assign(ppi_channel_rise, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_rise);
    APP_ERROR_CHECK(err);

    // fall ppi ss
    err = nrfx_ppi_channel_alloc(&ppi_channel_fall_ss);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL1);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppi_channel_fall_ss, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_fall_ss);
    APP_ERROR_CHECK(err);

    // fall ppi
    err = nrfx_ppi_channel_alloc(&ppi_channel_fall);
    APP_ERROR_CHECK(err);

    event_addr = nrfx_timer_compare_event_address_get(&m_spi_timer, NRF_TIMER_CC_CHANNEL1);
    task_addr = nrf_drv_spi_start_task_get(&m_dac_spi);

    err = nrfx_ppi_channel_assign(ppi_channel_fall, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_fall);
    APP_ERROR_CHECK(err);

    // spi end
    err = nrfx_ppi_channel_alloc(&ppi_channel_spi_end);
    APP_ERROR_CHECK(err);

    event_addr = nrf_drv_spi_end_event_get(&m_dac_spi);
    task_addr = nrfx_gpiote_out_task_addr_get(DAC_SPI_SS_PIN);
    // task_addr = nrfx_gpiote_set_task_addr_get(DAC_SPI_SS_PIN);

    err = nrfx_ppi_channel_assign(ppi_channel_spi_end, event_addr, task_addr);
    APP_ERROR_CHECK(err);

    err = nrfx_ppi_channel_enable(ppi_channel_spi_end);
    APP_ERROR_CHECK(err);


    /* init dac */
    static uint8_t pd[2] = { 0xD0, 0x3F };  // power down all but g and h
    static uint8_t wt[2] = { 0x90, 0x00 };  // set wtm mode
    static uint8_t hm[2] = { 0x78, 0x00 };  // set channel h to half
    static uint8_t gh[2] = { 0x6E, 0xB0 };  // set channel g high
    static uint8_t gl[2] = { 0x61, 0x00 };  // set channel g low

    static nrf_drv_spi_xfer_desc_t xfer = { .tx_length = 2, };

    // https://infocenter.nordicsemi.com/topic/sdk_nrf5_v17.1.0/hardware_driver_spi_master.html
    // !!! NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER suppress end event

    for (;;)
    {
        xfer.p_tx_buffer = pd;
        nrfx_gpiote_out_task_trigger(DAC_SPI_SS_PIN);
        err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, 0);
        APP_ERROR_CHECK(err);
        vTaskDelay(1);
        // nrfx_gpiote_out_set(DAC_SPI_SS_PIN);

        vTaskDelay(1000);
    }

    xfer.p_tx_buffer = wt;
    nrfx_gpiote_out_clear(DAC_SPI_SS_PIN);
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(1);
    nrfx_gpiote_out_set(DAC_SPI_SS_PIN);

    xfer.p_tx_buffer = hm;
    nrfx_gpiote_out_clear(DAC_SPI_SS_PIN);
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(1);
    nrfx_gpiote_out_set(DAC_SPI_SS_PIN);

    // assure low is seen on oscilloscope for 3 seconds
    xfer.p_tx_buffer = gl;
    nrfx_gpiote_out_clear(DAC_SPI_SS_PIN);
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER);
    APP_ERROR_CHECK(err);
    vTaskDelay(1);
    nrfx_gpiote_out_set(DAC_SPI_SS_PIN);

    vTaskDelay(3000);

    xfer.p_tx_buffer = gh;
    err = nrf_drv_spi_xfer(&m_dac_spi, &xfer, NRF_DRV_SPI_FLAG_HOLD_XFER);
    APP_ERROR_CHECK(err);

    nrf_drv_timer_enable(&m_spi_timer);
    NRF_LOG_INFO("test20: burst timer started");
}
#endif

/**
 * Timer 0 is reserved by SoftDevice
 * Timer 1 or 2 has 4 channels
 * Timer 3 or 4 has 6 channels
 *
 * channel 0, pulse on
 * channel 1, recycle on
 * channel 2, recycle off
 * channel 3, rewind (period end)
 */

/**
 * Howland
 */
#ifdef DAC_USE_SPI_MNGR
static void howland_task(void * pvParameters)
{
    // test3_run();
    // test6_run();
    vTaskDelay(portMAX_DELAY);
//  ret_code_t ret;

    ble_incomming_message_t * p_msg;
    uint16_t msg_length = sizeof(m_msg);

    bool stim_started = false;

    incomming_queue_init();

    timer_init();

    nrf_spi_mngr_init(&m_dac_spi_mngr, &m_dac_spi_config);
    // dac_update_simult(dac_reg_init);
    dac_update_same(0x80);

    nrf_spi_mngr_init(&m_asw_spi_mngr, &m_asw_spi_config);

    while (xQueueReceive(m_incomming_pending, &p_msg, portMAX_DELAY))
    {
        switch (p_msg->c)
        {
            case 0: // READ
                NRF_LOG_INFO("read from app");
                ble_nus_send((uint8_t *)&m_msg, &msg_length);
                break;
            case 1: // STOP
                if (stim_started)
                {
                    // stim_stop();
                    m_msg.c = 0;
                    stim_started = false;
                }
                ble_nus_send((uint8_t *)&m_msg, &msg_length);
                break;
            case 2: { // START // TODO check p_msg and reject
                if (stim_started)
                {
                    // stim_stop();
                }

                // TODO
//                m_msg = *p_msg;
//                m_msg.c = 0xffff;
//                m_msg.timeout = 0xffff;
//                m_msg.num_of_pulses = 1;
//
//                m_msg.pulse_width = (m_msg.pulse_width < 20) ? 20 : m_msg.pulse_width;
//                m_msg.pulse_width = (m_msg.pulse_width > 50 * 1000) ? 50 * 1000 : m_msg.pulse_width;
//
//                m_msg.pulse_interval = 0;
//                m_msg.mid = 0;
//                // m_msg.freq = 0;
//
//                m_msg.recycle = (m_msg.recycle < m_msg.pulse_width) ? m_msg.pulse_width : m_msg.recycle;
//                m_msg.recycle = (m_msg.recycle > 10 * m_msg.pulse_width) ? 10 * m_msg.pulse_width : m_msg.recycle;

//                stim_prepare();
//                stim_start();
//                stim_started = true;
                break;
            }
            default:
                break;
        }

        xQueueSend(m_incomming_idle, &p_msg, portMAX_DELAY);
        // TODO LOG error
    }
}
#else
static void howland_task(void * pvParameters)
{   
    test1();
    vTaskDelay(portMAX_DELAY);
}
#endif


void howland_freertos_init(void)
{
    BaseType_t xReturned;

    xReturned = xTaskCreate(howland_task,
                            "howl",
                            1024,   // stack size in word
                            NULL,
                            1,      // priority
                            &m_thread);

    if (xReturned != pdPASS)
    {
        NRF_LOG_INFO("no mem for howland task.");
    }
    else
    {
        NRF_LOG_INFO("howland task ready.");
    }
}

ble_incomming_message_t * ble_nus_alloc(void)
{
    ble_incomming_message_t * p_msg;

    NRF_LOG_INFO("idle q has %d messages", uxQueueMessagesWaiting(m_incomming_idle));

    if (pdTRUE == xQueueReceive(m_incomming_idle, &p_msg, 0))
    {
        return p_msg;
    }
    else
    {
        return NULL;
    }
}

ble_incomming_message_t * ble_nus_alloc_from_isr(void)
{
    ble_incomming_message_t * p_msg;
    if (pdTRUE == xQueueReceiveFromISR(m_incomming_idle, &p_msg, 0))
    {
        return p_msg;
    }
    else
    {
        return NULL;
    }
}

void ble_nus_recv(ble_incomming_message_t * p_message)
{
    if (p_message == NULL) return;

    // TODO log error
    xQueueSend(m_incomming_pending, &p_message, 0);
}

void ble_nus_recv_from_isr(ble_incomming_message_t * p_message)
{
    if (p_message == NULL) return;

    // TODO log error
    xQueueSendFromISR(m_incomming_pending, &p_message, 0);
}
